mdbsliguo/stm32_template_SPL/Examples/Timer/Timer04_DS3231ExternalClock32kHz/board.h
/**
 * @file board.h
 * @brief 硬件配置头文件（Timer04_DS3231ExternalClock32kHz案例独立工程专用）
 * @details 此文件包含案例所需的硬件配置
 * 
 * 注意：这是独立工程的board.h，包含案例所需的硬件配置
 */

#ifndef BOARD_H
#define BOARD_H

#include "stm32f10x.h"
#include <stdint.h>

/* ==================== UART配置 ==================== */

/* UART配置结构体 */
typedef struct
{
    USART_TypeDef *uart_periph;  /**< UART外设（USART1/2/3） */
    GPIO_TypeDef *tx_port;       /**< TX引脚端口 */
    uint16_t tx_pin;             /**< TX引脚号 */
    GPIO_TypeDef *rx_port;       /**< RX引脚端口 */
    uint16_t rx_pin;             /**< RX引脚号 */
    uint32_t baudrate;           /**< 波特率（如115200、9600等） */
    uint16_t word_length;         /**< 数据位：USART_WordLength_8b或USART_WordLength_9b */
    uint16_t stop_bits;          /**< 停止位：USART_StopBits_1或USART_StopBits_2 */
    uint16_t parity;             /**< 校验位：USART_Parity_No、USART_Parity_Even或USART_Parity_Odd */
    uint8_t enabled;             /**< 使能标志：1=启用，0=禁用 */
} UART_Config_t;

/* UART统一配置表 - Timer04案例配置（USART1，PA9/PA10，115200，8N1） */
#define UART_CONFIGS {                                                                                    \
    {USART1, GPIOA, GPIO_Pin_9, GPIOA, GPIO_Pin_10, 115200, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No, 1}, /* UART1：PA9(TX), PA10(RX)，115200，8N1，启用 */ \
}

/* ==================== OLED配置 ==================== */

/* OLED I2C接口类型 */
typedef enum {
    OLED_I2C_TYPE_SOFTWARE = 0,  /**< 软件I2C接口 */
    OLED_I2C_TYPE_HARDWARE = 1,  /**< 硬件I2C接口 */
} OLED_I2C_Type_t;

/* OLED I2C配置结构体（保留用于向后兼容） */
typedef struct
{
    GPIO_TypeDef *scl_port; /**< SCL引脚端口 */
    uint16_t scl_pin;       /**< SCL引脚号 */
    GPIO_TypeDef *sda_port; /**< SDA引脚端口 */
    uint16_t sda_pin;       /**< SDA引脚号 */
} OLED_I2C_Config_t;

/* OLED I2C配置 - Timer04案例配置 */
#define OLED_I2C_CONFIG {      \
    GPIOB,                     \
    GPIO_Pin_8, /* SCL: PB8 */ \
    GPIOB,                     \
    GPIO_Pin_9, /* SDA: PB9 */ \
}

/* OLED I2C接口类型配置（默认使用软件I2C） */
#ifndef OLED_I2C_TYPE
#define OLED_I2C_TYPE OLED_I2C_TYPE_SOFTWARE
#endif

/* OLED I2C实例配置（根据接口类型选择） */
#ifndef OLED_I2C_SOFT_INSTANCE
#define OLED_I2C_SOFT_INSTANCE 0  /* SOFT_I2C_INSTANCE_1 */
#endif

#ifndef OLED_I2C_HARD_INSTANCE
#define OLED_I2C_HARD_INSTANCE 0  /* I2C_INSTANCE_1 */
#endif

/* ==================== 软件I2C配置 ==================== */

/* 软件I2C配置结构体 */
typedef struct
{
    GPIO_TypeDef *scl_port;         /**< SCL引脚端口 */
    uint16_t scl_pin;               /**< SCL引脚号 */
    GPIO_TypeDef *sda_port;         /**< SDA引脚端口 */
    uint16_t sda_pin;               /**< SDA引脚号 */
    uint32_t delay_us;              /**< I2C时序延时（微秒），建议值：5-10us（标准模式），2-5us（快速模式） */
    uint8_t enabled;                /**< 使能标志：1=启用，0=禁用 */
} SoftI2C_Config_t;

/* 软件I2C统一配置表 - Timer04案例配置 */
/* 注意：数组索引对应SoftI2C_Instance枚举值，SoftI2C_INSTANCE_1=0, SOFT_I2C_INSTANCE_2=1 */
#define SOFT_I2C_CONFIGS {                                                                    \
    {GPIOB, GPIO_Pin_8, GPIOB, GPIO_Pin_9, 5, 1}, /* SoftI2C1：PB8(SCL), PB9(SDA)，5us延时，启用（OLED使用） */ \
    {GPIOB, GPIO_Pin_10, GPIOB, GPIO_Pin_11, 5, 1}, /* SoftI2C2：PB10(SCL), PB11(SDA)，5us延时，启用（DS3231使用） */ \
}

/* ==================== TIM1 ETR引脚配置 ==================== */

/* TIM1 ETR引脚配置 - Timer04案例配置 */
/* 注意：TIM1的ETR引脚是PA12，用于接收DS3231的32K输出（32kHz时钟） */
/* 重要：在STM32F103C8T6中，TIM3没有ETR引脚，只有TIM1和TIM2有ETR引脚 */
/* TIM2的ETR引脚是PA0，TIM1的ETR引脚是PA12 */
/* ?? 警告：TIM2已被TIM2_TimeBase模块占用（系统时间基准），不能用于外部时钟！ */
/* 因此本案例使用TIM1，TIM1的ETR引脚是PA12（不是PA0！） */
#define TIM1_ETR_PORT  GPIOA
#define TIM1_ETR_PIN   GPIO_Pin_12  /* PA12 = TIM1_ETR */

/* ==================== LED配置（占位，避免编译错误） ==================== */

/* LED配置结构体（案例不使用LED，但需要定义以避免编译错误） */
typedef struct
{
    GPIO_TypeDef *port;   /**< GPIO端口基地址 */
    uint16_t pin;         /**< 引脚号 */
    uint8_t active_level; /**< 有效电平（Bit_SET或Bit_RESET） */
    uint8_t enabled;      /**< 使能标志：1=启用，0=禁用 */
} LED_Config_t;

/* LED统一配置表 - 空配置（案例不使用LED，但需要至少一个元素避免编译错误） */
#define LED_CONFIGS { \
    {NULL, 0, 0, 0}, /* 占位元素，禁用 */ \
}

/* ==================== 时钟管理配置（占位，避免编译错误） ==================== */

/* 时钟管理配置 - 默认配置（Timer04不使用，但需要定义以避免编译错误） */
#define CLKM_LOAD_CHECK_INTERVAL 50    /* 负载检测周期：50ms */
#define CLKM_LOAD_THRESHOLD_HIGH 50    /* 高负载阈值：50% */
#define CLKM_LOAD_THRESHOLD_LOW 30     /* 低负载阈值：30% */
#define CLKM_AUTO_POLICY_STEP 1        /* 降档步进：1档 */
#define CLKM_AUTO_POLICY_JUMP 3        /* 升档跳跃：3档 */
#define CLKM_SWITCH_INTERVAL_UP 1000   /* 升频间隔：1秒 */
#define CLKM_SWITCH_INTERVAL_DOWN 5000 /* 降频间隔：5秒 */
#define CLKM_ADAPTIVE_ENABLE 0         /* 禁用自动调频（Timer04不使用） */
#define CLKM_IDLE_HOOK_ENABLE 0        /* 禁用空闲钩子（Timer04不使用） */

#endif /* BOARD_H */
